# Create data and Basic operation

In [1]:
import pandas as pd

## Create DataFrame

### array

In [2]:
arr = [["Eddie",85,90,40,40], 
       ["Amy",70,90,70,90],
       ["James",85,90,50,70],
       ["Wade",70,80,55,80],
      ]

In [3]:
#create data 
pd.DataFrame(arr, columns = ["Name", "Math","Chemistry","Chinese","English"])

    Name  Math  Chemistry  Chinese  English
0  Eddie    85         90       40       40
1    Amy    70         90       70       90
2  James    85         90       50       70
3   Wade    70         80       55       80

###  dict

In [4]:
data  = {
        "Name": ["Eddie", "Amy", "James","Wade"],  
        "Math": ["85", "70", "85","70"],  
        "Chemistry": ["90", "90", "90","80"],  
        "Chinese": ["40", "70", "50","55"],  
        "English": ["40", "90", "70","80"],  
       }

In [5]:
pd.DataFrame(data)

    Name Math Chemistry Chinese English
0  Eddie   85        90      40      40
1    Amy   70        90      70      90
2  James   85        90      50      70
3   Wade   70        80      55      80

In [6]:
#choose columns ,also can modify order
pd.DataFrame(data,columns = ['Name','Math','English','Chemistry'])

    Name Math English Chemistry
0  Eddie   85      40        90
1    Amy   70      90        90
2  James   85      70        90
3   Wade   70      80        80

### dictionary array

In [7]:
# input dictionary array
data = [{ 'Name':'Eddie','Math': 85,'Chemistry': 90,'Chinese': 40,'English': 40},
        { 'Name':'Amy','Math': 70,'Chemistry': 90,'Chinese': 70, 'English': 90},
        { 'Name':'James','Math': 85,'Chemistry': 90,'Chinese': 50,'English': 70},
        { 'Name':'Wade','Math': 70,'Chemistry': 80,'Chinese': 55,'English': 80},
       ]

In [8]:
#choose columns ,also can modify order
pd.DataFrame(data,columns = ['Name','Math','English','Chemistry'])

    Name  Math  English  Chemistry
0  Eddie    85       40         90
1    Amy    70       90         90
2  James    85       70         90
3   Wade    70       80         80

### dictionary with dictionary

In [9]:
data2 = {'Eddie':{'Math': 85,'Chemistry': 90,'Chinese': 40,'English': 40},
        'Amy':{'Math': 70,'Chemistry': 90,'Chinese': 70, 'English': 90},
        'James':{'Math': 85,'Chemistry': 90,'Chinese': 50,'English': 70},
        'Wade':{'Math': 70,'Chemistry': 80,'Chinese': 55,'English': 80},   
       }

In [10]:
pd.DataFrame(data2)

           Eddie  Amy  James  Wade
Math          85   70     85    70
Chemistry     90   90     90    80
Chinese       40   70     50    55
English       40   90     70    80

In [11]:
pd.DataFrame(data2).T

       Math  Chemistry  Chinese  English
Eddie    85         90       40       40
Amy      70         90       70       90
James    85         90       50       70
Wade     70         80       55       80

## Attributes

<ul>
    <li>shape</li>
    <li>describe()</li>  
    <li>columns</li>
    <li>index</li>
    <li>empty</li>
</ul>

In [12]:
# get Attributes
df = pd.DataFrame(data)

In [13]:
df

    Name  Math  Chemistry  Chinese  English
0  Eddie    85         90       40       40
1    Amy    70         90       70       90
2  James    85         90       50       70
3   Wade    70         80       55       80

### shape

In [14]:
df.shape

(4, 5)

### describe()

In [15]:
df.describe()

            Math  Chemistry  Chinese    English
count   4.000000        4.0     4.00   4.000000
mean   77.500000       87.5    53.75  70.000000
std     8.660254        5.0    12.50  21.602469
min    70.000000       80.0    40.00  40.000000
25%    70.000000       87.5    47.50  62.500000
50%    77.500000       90.0    52.50  75.000000
75%    85.000000       90.0    58.75  82.500000
max    85.000000       90.0    70.00  90.000000

In [16]:
df.max()

Name         Wade
Math           85
Chemistry      90
Chinese        70
English        90
dtype: object

In [17]:
df['Math'].max()

85

In [18]:
df.sum()

Name         EddieAmyJamesWade
Math                       310
Chemistry                  350
Chinese                    215
English                    280
dtype: object

### columns

In [19]:
df.columns

Index(['Name', 'Math', 'Chemistry', 'Chinese', 'English'], dtype='object')

In [20]:
# get list of column
list(df.columns)

['Name', 'Math', 'Chemistry', 'Chinese', 'English']

### index

In [21]:
df.index

RangeIndex(start=0, stop=4, step=1)

### empty

In [22]:
df.empty

False

### Info

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
Name         4 non-null object
Math         4 non-null int64
Chemistry    4 non-null int64
Chinese      4 non-null int64
English      4 non-null int64
dtypes: int64(4), object(1)
memory usage: 288.0+ bytes

### dtypes

In [24]:
df.dtypes

Name         object
Math          int64
Chemistry     int64
Chinese       int64
English       int64
dtype: object

### unique

In [25]:
df['Name'].unique()

array(['Eddie', 'Amy', 'James', 'Wade'], dtype=object)

## operation

### df.rename

修改columns name

In [26]:
df.rename(columns = {'Name':'First Name','English':"Sport"})

  First Name  Math  Chemistry  Chinese  Sport
0      Eddie    85         90       40     40
1        Amy    70         90       70     90
2      James    85         90       50     70
3       Wade    70         80       55     80

也可以透過axis來指定修改col(axis = 1)或row(axis = 0)

In [27]:
df.rename({'Name':'First Name','English':"Sport"},axis=1)

  First Name  Math  Chemistry  Chinese  Sport
0      Eddie    85         90       40     40
1        Amy    70         90       70     90
2      James    85         90       50     70
3       Wade    70         80       55     80

也可以使用 df.columns = [col_name]

In [28]:
df.columns = ['First Name','Math','Chemistry','Chinese','Sport']

修改index name

In [29]:
df.rename(index={0: "x", 1: "y", 2: "z"})

  First Name  Math  Chemistry  Chinese  Sport
x      Eddie    85         90       40     40
y        Amy    70         90       70     90
z      James    85         90       50     70
3       Wade    70         80       55     80

### df.set_index

設定欄位當index

In [30]:
df.set_index(["First Name"])

            Math  Chemistry  Chinese  Sport
First Name
Eddie         85         90       40     40
Amy           70         90       70     90
James         85         90       50     70
Wade          70         80       55     80

### df.sort_values

<a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html" rel="nofollow">詳細連結</a>

In [31]:
df.sort_values(by=['Chinese','Chemistry'])

  First Name  Math  Chemistry  Chinese  Sport
0      Eddie    85         90       40     40
2      James    85         90       50     70
3       Wade    70         80       55     80
1        Amy    70         90       70     90

設定ascending為False,預設為True

In [32]:
df.sort_values(by=['Chinese','Chemistry'],ascending = False)

  First Name  Math  Chemistry  Chinese  Sport
1        Amy    70         90       70     90
3       Wade    70         80       55     80
2      James    85         90       50     70
0      Eddie    85         90       40     40

### df.fillna("")

### df.groupby

In [33]:
df.groupby('First Name')